-- --------------------------------------------------------
-- 호스트:                          k9a608a.p.ssafy.io
-- 서버 버전:                        11.1.2-MariaDB-1:11.1.2+maria~ubu2204 - mariadb.org binary distribution
-- 서버 OS:                        debian-linux-gnu
-- HeidiSQL 버전:                  12.3.0.6589
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 musiqdb.member_info 구조 내보내기
CREATE TABLE IF NOT EXISTS `member_info` (
  `id` uuid NOT NULL,
  `created_at` datetime(6) NOT NULL DEFAULT current_timestamp(6),
  `updated_at` datetime(6) NOT NULL DEFAULT current_timestamp(6),
  `deleted` bit(1) NOT NULL DEFAULT b'0',
  `exp` double NOT NULL,
  `nickname` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- 테이블 데이터 musiqdb.member_info:~29 rows (대략적) 내보내기
INSERT INTO `member_info` (`id`, `created_at`, `updated_at`, `deleted`, `exp`, `nickname`) VALUES
	('f0b0b745-96f8-493a-8919-0b612f97f8d5', '2023-11-10 15:28:09.713661', '2023-11-10 15:28:09.713661', b'0', 0, '병병'),
	('e10fc3d4-e39d-4c5b-b403-0f2899259ce7', '2023-11-12 20:56:19.280716', '2023-11-15 16:44:21.041860', b'0', 294, '1234'),
	('81968540-6256-45da-ba08-11d83af1891c', '2023-11-14 12:08:47.248923', '2023-11-16 12:21:00.015849', b'0', 50, 'qwer'),
	('2cd2226a-a2c6-43e6-b67e-158c38c1caea', '2023-11-16 09:22:04.517718', '2023-11-16 09:22:04.517718', b'0', 0, 'testww'),
	('e493e416-ca73-4092-8ff0-228793ead3f3', '2023-11-15 15:28:31.953275', '2023-11-15 15:28:31.953275', b'0', 0, 'testtttt'),
	('90aedbdd-6c71-4e50-8293-27d1febff355', '2023-11-14 22:18:12.027719', '2023-11-17 03:42:36.020295', b'0', 30, '사랑한다최강한화'),
	('51be4b6c-6c14-41f6-ba16-29b5295488e9', '2023-11-11 21:30:04.343586', '2023-11-11 21:31:56.632850', b'0', 3, '웹소켓죽어라'),
	('84c45cba-af61-414f-82ea-481404261e9b', '2023-11-10 23:38:57.233164', '2023-11-17 03:31:27.045882', b'0', 390, '장충동왕족발보쌈'),
	('5e11e31b-75f4-4b0d-8cde-562ed7f29a7a', '2023-11-10 18:12:22.894960', '2023-11-17 11:44:27.007608', b'0', 417, '히짱짱이'),
	('387bfead-15a1-4982-bd7c-60b92f34c046', '2023-11-15 15:29:17.067616', '2023-11-15 15:29:17.067616', b'0', 0, 'teste'),
	('cf8001ad-fe02-4552-b660-6aa5f375ac58', '2023-11-13 16:24:16.667418', '2023-11-13 16:24:16.667439', b'0', 0, 'yo12yo'),
	('0f94372c-a095-4490-ba13-6e6759a59d20', '2023-11-15 09:30:34.528571', '2023-11-15 09:30:34.528571', b'0', 0, 'postman'),
	('450efe4e-5ac7-417c-bbae-76343b8aaf71', '2023-11-13 16:25:16.262714', '2023-11-13 16:25:16.262731', b'0', 0, '장실휴지도둑병철'),
	('197e8b81-0117-4975-bc04-763831eee11c', '2023-11-11 21:58:34.024122', '2023-11-11 21:58:34.024135', b'0', 0, '으락캬'),
	('429e5d70-8108-4dde-82a6-7bed6da04fd9', '2023-11-15 12:31:51.030531', '2023-11-15 16:19:52.029415', b'0', 60, 'asdf'),
	('b5866b46-ecc5-43ca-bf8c-a187554dedda', '2023-11-11 17:40:11.931441', '2023-11-11 17:40:11.931441', b'0', 0, '웹소켓다이'),
	('3499c151-7669-488d-9c85-a3fb066c8b7e', '2023-11-11 21:42:49.402819', '2023-11-17 03:42:36.009637', b'0', 330, '이렇게'),
	('bcad2859-670d-4652-b630-a9db08a62ba5', '2023-11-10 15:23:11.139099', '2023-11-10 15:23:11.139099', b'0', 0, '이거보세요오'),
	('0c9fd69e-eeaa-4656-b2ac-ac171f531b16', '2023-11-16 09:45:35.900732', '2023-11-16 09:45:35.900732', b'0', 0, 'testrr'),
	('a38b2b44-6b66-4024-8fd1-b8e4c52db83b', '2023-11-10 23:37:12.355743', '2023-11-11 01:23:55.115791', b'0', 4, '웹소켓죽어'),
	('4161ab43-ddec-49ba-b5d6-babf03612a14', '2023-11-16 09:47:27.350686', '2023-11-16 09:47:27.350686', b'0', 0, 'testyy'),
	('87993755-1ca1-4882-af1e-bf1f6ca9e4b5', '2023-11-16 15:26:57.948581', '2023-11-16 15:28:17.971243', b'0', 6, '테스트용입니다'),
	('61038cea-db07-4a25-905c-c5f6f7e4d703', '2023-11-12 20:47:57.807309', '2023-11-12 20:47:57.807353', b'0', 0, '아의년맨그대여'),
	('3763e218-c5f6-4f0b-ad37-cc52567fba57', '2023-11-17 00:34:07.293037', '2023-11-17 00:34:07.293037', b'0', 0, 'testuu'),
	('b8c49b0c-b125-4082-a9af-ce253e7a3268', '2023-11-16 09:46:43.297518', '2023-11-16 09:46:43.297518', b'0', 0, 'testtt'),
	('cb5b958e-e48d-43f7-b235-e3c77c1577b9', '2023-11-12 00:46:01.936656', '2023-11-12 00:46:01.936673', b'0', 0, '으락카'),
	('b06a6f6c-624d-4f6f-9ebc-ef5ab9fc17eb', '2023-11-12 18:50:49.170581', '2023-11-12 18:50:49.170581', b'0', 0, '아의년맨'),
	('eab2d20e-d8a3-4646-a146-f333a5398c68', '2023-11-12 21:00:26.812662', '2023-11-12 21:00:26.812676', b'0', 0, 'gg'),
	('b26cc733-fc5f-4914-9188-fa6368c0dd47', '2023-11-16 09:21:26.570252', '2023-11-16 09:21:26.570252', b'0', 0, 'testqq');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
