-- --------------------------------------------------------
-- 호스트:                          k9a608a.p.ssafy.io
-- 서버 버전:                        11.1.2-MariaDB-1:11.1.2+maria~ubu2204 - mariadb.org binary distribution
-- 서버 OS:                        debian-linux-gnu
-- HeidiSQL 버전:                  12.3.0.6589
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 musiqdb.multi_mode_create_game_room_log 구조 내보내기
CREATE TABLE IF NOT EXISTS `multi_mode_create_game_room_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `created_at` datetime(6) NOT NULL,
  `is_started` bit(1) NOT NULL,
  `room_manager_nickname` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `years` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- 테이블 데이터 musiqdb.multi_mode_create_game_room_log:~56 rows (대략적) 내보내기
INSERT INTO `multi_mode_create_game_room_log` (`id`, `created_at`, `is_started`, `room_manager_nickname`, `title`, `years`) VALUES
	(1, '2023-11-16 10:56:53.712406', b'0', '1234', 'qew', '2023'),
	(2, '2023-11-16 11:08:23.108919', b'0', '이렇게', '들오셈', '2000 2010 2015 2020 2021 2022 2023'),
	(3, '2023-11-16 11:31:31.539216', b'0', '장충동왕족발보쌈', 'sadfsd', '2023'),
	(4, '2023-11-16 11:44:49.337769', b'0', '장충동왕족발보쌈', 'ㅂㅈㄷㄱ', '1980'),
	(5, '2023-11-16 11:45:01.335690', b'0', '장충동왕족발보쌈', 'sdf', '2023'),
	(6, '2023-11-16 11:45:27.176642', b'0', '장충동왕족발보쌈', 'ㄴㅇㄹ', '2015'),
	(7, '2023-11-16 11:48:41.652234', b'0', '장충동왕족발보쌈', 'asd', '2023'),
	(8, '2023-11-16 11:51:38.889088', b'0', '장충동왕족발보쌈', 'asf', '2023'),
	(9, '2023-11-16 11:55:20.358050', b'0', '이렇게', 'qwdqwd', '1970'),
	(10, '2023-11-16 11:57:44.582949', b'0', '장충동왕족발보쌈', '시바', '1980 2010'),
	(11, '2023-11-16 11:58:06.978009', b'0', '장충동왕족발보쌈', 'asd', '2023'),
	(12, '2023-11-16 11:59:13.070884', b'0', '히짱짱이', 'fgd', '2000'),
	(13, '2023-11-16 12:01:40.657548', b'0', '장충동왕족발보쌈', 'asd', '2023'),
	(14, '2023-11-16 12:05:16.558145', b'0', '웹소켓죽어라', 'wer', '1980'),
	(15, '2023-11-16 12:11:10.863412', b'0', '장충동왕족발보쌈', 'asd', '2023'),
	(16, '2023-11-16 12:12:12.921444', b'0', '웹소켓죽어라', '234', '2023'),
	(17, '2023-11-16 12:12:23.807904', b'0', 'qwer', 'sadf', '2023'),
	(18, '2023-11-16 15:13:12.999171', b'0', '히짱짱이', '123', '1970'),
	(19, '2023-11-16 15:15:50.659494', b'0', '히짱짱이', 'asd', '1970'),
	(20, '2023-11-16 15:30:28.701322', b'0', '테스트용입니다', '공개방이에용', '2000 2010'),
	(21, '2023-11-16 15:30:29.202605', b'0', '이렇게', '고수만', '2010 2015'),
	(22, '2023-11-16 15:32:07.831818', b'0', '테스트용입니다', '비밀방입니다', '2010 1980 2021'),
	(23, '2023-11-16 15:32:56.155319', b'0', '이렇게', '비공개방인데요', '2020 2010 2015'),
	(24, '2023-11-17 00:25:22.900037', b'0', '웹소켓죽어라', '덤벼랏', '2010 2015 2020'),
	(25, '2023-11-17 00:30:13.172081', b'0', 'testqq', '뚜두', '2010'),
	(26, '2023-11-17 00:30:34.606656', b'0', 'testww', 'ee', '2010'),
	(27, '2023-11-17 00:31:06.229164', b'0', 'testrr', 'wer', '2010'),
	(28, '2023-11-17 00:32:24.191538', b'0', 'testrr', 'erwer', '2010'),
	(29, '2023-11-17 00:33:00.982229', b'0', 'testtt', '호호', '2000'),
	(30, '2023-11-17 00:33:31.651468', b'0', 'testyy', 'wer', '2000'),
	(31, '2023-11-17 00:34:18.677386', b'0', 'testuu', 'twere', '2015'),
	(32, '2023-11-17 03:05:11.013789', b'0', '히짱짱이', 'asd', '1970'),
	(33, '2023-11-17 03:16:23.752299', b'1', '히짱짱이', 'asd', '1970'),
	(34, '2023-11-17 03:19:34.668536', b'0', '히짱짱이', 'sssssss', '1980'),
	(35, '2023-11-17 03:19:51.475173', b'1', '히짱짱이', 'ㅇㅋㅇㅋ', '2023'),
	(36, '2023-11-17 03:28:16.104988', b'1', '장충동왕족발보쌈', 'ㅁㄴㅇ', '2023'),
	(37, '2023-11-17 03:34:25.946239', b'0', '장충동왕족발보쌈', 'ㅍㄻㄴㅇㅍ', '2023'),
	(38, '2023-11-17 03:35:04.213597', b'0', '장충동왕족발보쌈', 'asf', '2023'),
	(39, '2023-11-17 03:36:30.479118', b'0', '장충동왕족발보쌈', 'asf', '2023'),
	(40, '2023-11-17 03:37:42.450178', b'1', '히짱짱이', '마지막', '1970'),
	(41, '2023-11-17 03:38:05.368857', b'0', '장충동왕족발보쌈', 'asd', '2023'),
	(42, '2023-11-17 03:39:28.771785', b'1', '히짱짱이', 'ㅁㅁㅁ', '2023'),
	(43, '2023-11-17 03:39:34.347609', b'0', '장충동왕족발보쌈', 'asd', '2023'),
	(44, '2023-11-17 10:52:05.030779', b'1', '히짱짱이', 'ddd', '2023'),
	(45, '2023-11-17 10:54:15.596785', b'1', '장충동왕족발보쌈', 'fbdf', '2023'),
	(46, '2023-11-17 10:55:31.610155', b'1', '장충동왕족발보쌈', 'dvsd', '2023'),
	(47, '2023-11-17 10:56:27.039370', b'1', '장충동왕족발보쌈', 'ㄴㅇㅍ', '2023'),
	(48, '2023-11-17 10:57:45.847784', b'1', '히짱짱이', 'ㅇㅇ', '2023'),
	(49, '2023-11-17 10:58:30.285630', b'1', '장충동왕족발보쌈', 'ㄴㅇㄹ', '2023'),
	(50, '2023-11-17 10:59:38.686882', b'1', '히짱짱이', 'ㅇㅇㅇㅇ', '2023'),
	(51, '2023-11-17 11:03:36.366891', b'1', '이렇게', 'asdasd', '2000 2010 2015 2022 2021 2020 2023'),
	(52, '2023-11-17 11:04:59.457949', b'1', '히짱짱이', 'ㅇㅇㅇ', '2023'),
	(53, '2023-11-17 11:05:32.033680', b'1', '히짱짱이', 'dd', '2023'),
	(54, '2023-11-17 11:12:34.087305', b'1', '히짱짱이', 'sd', '2023'),
	(55, '2023-11-17 11:38:52.288155', b'1', '히짱짱이', 'sd', '1970 2023'),
	(56, '2023-11-17 11:43:05.409459', b'1', '히짱짱이', 'sd', '2023');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
